salary = [
    ['Иванов Е.С.', 7461.58, 8487.61, 8143.43, 7896.41, 5921.96, 7295.52],
    ['Андреев И.В.', 6548.97, 7951.47, 7259.54, 8053.5, 7891.67, 7317.24],
    ['Петров А.И.', 5258.5, 6124.87, 3528.97, 5957.54, 4978.54, 6157.41],
]

months = ['январь', 'февраль', 'март', 'апрель', 'май', 'июнь']

#worker_1 = ['Иванов Е.С.', 7461.58, 8487.61, 8143.43, 7896.41, 5921.96, 7295.52]
#worker_2 = ['Андреев И.В.', 6548.97, 7951.47, 7259.54, 8053.5, 7891.67, 7317.24]
#worker_3 = ['Петров А.И.', 5258.5, 6124.87, 3528.97, 5957.54, 4978.54, 6157.41]

#salary = [worker_1, worker_2, worker_3]

workers_zip = list(zip(*salary))
workers = workers_zip.pop(0)

print(list(workers_zip))

for _idx, _iter in enumerate(workers_zip):
    salary_avg = sum(_iter)/len(_iter)
    print(f'Средняя зарплата за {months[_idx]}: {salary_avg:.2f}')
